zpq001/mdr32f9q-ps200w/src/converter.c
/********************************************************************
	Module		Converter
	
	Purpose:
		
					
	Globals used:

		
	Operation: FIXME

********************************************************************/

#include "MDR32Fx.h" 
#include "MDR32F9Qx_port.h"

#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"

#include "systemfunc.h"
#include "led.h"
#include "adc.h"
#include "defines.h"
#include "control.h"
#include "converter.h"
#include "sound_driver.h"

#include "guiTop.h"


// Globals used for communicating with converter control task called from ISR
volatile uint8_t state_HWProcess = STATE_HW_OFF;	
volatile uint8_t ctrl_HWProcess = 0;

volatile uint8_t cmd_ADC_to_HWProcess = 0;


static gui_msg_t gui_msg;


converter_regulation_t channel_5v;
converter_regulation_t channel_12v;
converter_regulation_t *regulation_setting_p;







const conveter_message_t converter_tick_message = 	{	CONVERTER_TICK, 0, 0 };
const conveter_message_t converter_update_message = {	CONVERTER_UPDATE, 0, 0 };
//const conveter_message_t converter_init_message = {	CONVERTER_INITIALIZE, 0, 0 };


xQueueHandle xQueueConverter;


//static void apply_regulation(void);
//static uint16_t CheckSetVoltageRange(int32_t new_set_voltage, uint8_t *err_code);
//static uint16_t CheckSetCurrentRange(int32_t new_set_current, uint8_t *err_code);

static void ApplyAnalogRegulation(uint8_t code);
static uint8_t SetRegulationValue(reg_setting_t *s, int32_t new_value);
static uint8_t SetRegulationLimit(reg_setting_t *s, uint8_t limit_type, int32_t new_value, uint8_t enable);

static uint8_t Converter_SetVoltage(uint8_t channel, int32_t new_value, uint8_t *err_code);
static uint8_t Converter_SetCurrent(uint8_t channel, uint8_t current_range, int32_t new_value, uint8_t *err_code);
static uint8_t Converter_SetVoltageLimit(uint8_t channel, uint8_t limit_type, int32_t new_value, uint8_t enable, uint8_t *err_code);
static uint8_t Converter_SetCurrentLimit(uint8_t channel, uint8_t current_range, uint8_t limit_type, int32_t new_value, uint8_t enable, uint8_t *err_code);
static uint8_t Converter_SetProtectionControl(uint8_t channel, uint8_t protection_enable, int16_t overload_timeout, uint8_t *err_code = 0);
// SetChannel
// SetCurrentRange

uint32_t conv_state = CONV_OFF;



// Analog regulation apply function arguments
#define APPLY_VOLTAGE	0x01
#define APPLY_CURRENT	0x02


// Voltage and current setting return codes
#define VALUE_OK					0x00
#define VALUE_BOUND_BY_SOFT_MAX		0x01
#define VALUE_BOUND_BY_SOFT_MIN		0x02
#define VALUE_BOUND_BY_ABS_MAX		0x04
#define VALUE_BOUND_BY_ABS_MIN		0x08




//---------------------------------------------------------------------------//
//	Applies operating channel voltage and current settings
//---------------------------------------------------------------------------//
static void ApplyAnalogRegulation(uint8_t code)
{
	uint16_t temp;
	
	if (code & APPLY_VOLTAGE)
	{
		temp = regulation_setting_p->voltage.setting;
		temp /= 5;
		SetVoltagePWMPeriod(temp);		// FIXME - we are setting not period but duty
	}
	if (code & APPLY_CURRENT)
	{
		temp = regulation_setting_p->current->setting;
		temp = (regulation_setting_p->current->RANGE == CURRENT_RANGE_HIGH) ? temp / 2 : temp;
		temp /= 5;
		SetCurrentPWMPeriod(temp);		// FIXME - we are setting not period but duty
	}
	
	/*
static void apply_regulation(void)
{
	uint16_t temp;
	
	// Apply voltage - same for both 5V and 12V channels
	temp = regulation_setting_p->voltage.setting;
	temp /= 5;
	SetVoltagePWMPeriod(temp);		// FIXME - we are setting not period but duty
	
	// Apply current different for 20A and 40A limits
	temp = regulation_setting_p->current->setting;
	temp = (regulation_setting_p->current->RANGE == CURRENT_RANGE_HIGH) ? temp / 2 : temp;
	temp /= 5;
	SetCurrentPWMPeriod(temp);		// FIXME - we are setting not period but duty
}
*/
}




//---------------------------------------------------------------------------//
//	Checks and sets new value in regultaion structure
//---------------------------------------------------------------------------//
static uint8_t SetRegulationValue(reg_setting_t *s, int32_t new_value)
{
	uint8_t result = VALUE_OK;;
	// Check software limits
	if (new_value <= (int32_t)s->limit_low)
	{	
		new_value = (int32_t)s->limit_low;
		result = VALUE_BOUND_BY_SOFT_MIN;
	}
	if (new_value >= (int32_t)s->limit_high) 
	{
		new_value = (int32_t)s->limit_high;
		result = VALUE_BOUND_BY_SOFT_MAX;
	} 
	// Check absolute limits
	if (new_value <= (int32_t)s->MINIMUM)
	{	
		new_value = (int32_t)s->MINIMUM;
		result = VALUE_BOUND_BY_ABS_MIN;
	}
	if (new_value >= (int32_t)s->MAXIMUM) 
	{
		new_value = (int32_t)s->MAXIMUM;
		result = VALUE_BOUND_BY_ABS_MAX;
	} 
	s->setting = new_value;
	return result;
}

//---------------------------------------------------------------------------//
//	Checks and sets new value limit in regultaion structure
//---------------------------------------------------------------------------//
static uint8_t SetRegulationLimit(reg_setting_t *s, uint8_t limit_type, int32_t new_value, uint8_t enable)
{
	uint8_t result = VALUE_OK;;
	if (new_value <= (int32_t)s->LIMIT_MIN)
	{	
		new_value = (int32_t)s->LIMIT_MIN;
		result = VALUE_BOUND_BY_ABS_MIN;
	}
	if (new_value >= (int32_t)s->LIMIT_MAX) 
	{
		new_value = (int32_t)s->LIMIT_MAX;
		result = VALUE_BOUND_BY_ABS_MAX;
	} 
	if (limit_type == LIMIT_TYPE_LOW)
	{
		s->limit_low = new_value;
		s->enable_low_limit = enable;
	}
	else if (limit_type == LIMIT_TYPE_HIGH)
	{
		s->limit_high = new_value;
		s->enable_high_limit = enable;
	}
	return result;
}





//---------------------------------------------------------------------------//
// 	Set converter output voltage
//	input:
//		channel - converter channel to affect
//		new_value - new value to check and set
//		*err_code - return code providing information about 
//			limiting new value by absolute and software limits
//	output:
//		non-zero if operating channel has been affected
//---------------------------------------------------------------------------//
static uint8_t Converter_SetVoltage(uint8_t channel, int32_t new_value, uint8_t *err_code = 0)
{
	converter_regulation_t *r = (channel == CHANNEL_5V) ? &channel_5v : 
								((channel == CHANNEL_12V) ? &channel_12v : regulation_setting_p);
	uint8_t operating_channel_affected = 0;
								
	uint8_t result = SetRegulationValue(&r->voltage, new_value);
	if (err_code) *err_code = result;
	
	// Update hardware
	if (r == regulation_setting_p)
	{
		ApplyAnalogRegultaion(APPLY_VOLTAGE);
		operating_channel_affected = 1;
	}
	return operating_channel_affected;
}


//---------------------------------------------------------------------------//
// 	Set converter output current
//	input:
//		channel - converter channel to affect
//		current_range - 20A range or 40A range to modify
//		new_value - new value to check and set
//		*err_code - return code providing information about 
//			limiting new value by absolute and software limits
//	output:
//		non-zero if operating channel has been affected
//---------------------------------------------------------------------------//
static uint8_t Converter_SetCurrent(uint8_t channel, uint8_t current_range, int32_t new_value, uint8_t *err_code = 0)
{
	converter_regulation_t *r = (channel == CHANNEL_5V) ? &channel_5v : 
								((channel == CHANNEL_12V) ? &channel_12v : regulation_setting_p);
	reg_setting_t *s = (current_range == CURRENT_RANGE_LOW) ? r->current_low_range : 
					   ((current_range == CURRENT_RANGE_HIGH) ? r->current_high_range : r->current);
	uint8_t operating_channel_affected = 0;
	
	uint8_t result = SetRegulationValue(s, new_value);
	if (err_code) *err_code = result;
	
	// Update hanrdware
	if (s == regulation_setting_p->current)
	{
		ApplyAnalogRegultaion(APPLY_CURRENT);
		operating_channel_affected = 1;
	}
	return 	operating_channel_affected;			   
}


//---------------------------------------------------------------------------//
// 	Set converter voltage limit
//	input:
//		channel - converter channel to affect
//		limit_type - low or high limit to modify
//		new_value - new value to check and set
//		enable - set limit enabled or disabled
//		*err_code - return code providing information about 
//			limiting new value by absolute and software limits
//	output:
//		non-zero if operating channel has been affected
//---------------------------------------------------------------------------//
static uint8_t Converter_SetVoltageLimit(uint8_t channel, uint8_t limit_type, int32_t new_value, uint8_t enable, uint8_t *err_code = 0)
{
	converter_regulation_t *r = (channel == CHANNEL_5V) ? &channel_5v : 
								((channel == CHANNEL_12V) ? &channel_12v : regulation_setting_p);
								
	uint8_t result = SetRegulationLimit(&r->voltage, limit_type, new_value, enable);
	if (err_code) *err_code = result;
	
	// Ensure that voltage setting lies inside new limits
	return Converter_SetVoltage(channel, r->voltage.setting);
}

//---------------------------------------------------------------------------//
// 	Set converter current limit
//	input:
//		channel - converter channel to affect
//		current_range - 20A range or 40A range to modify
//		limit_type - low or high limit to modify
//		new_value - new value to check and set
//		enable - set limit enabled or disabled
//		*err_code - return code providing information about 
//			limiting new value by absolute and software limits
//	output:
//		non-zero if operating channel has been affected
//---------------------------------------------------------------------------//
static uint8_t Converter_SetCurrentLimit(uint8_t channel, uint8_t current_range, uint8_t limit_type, int32_t new_value, uint8_t enable, uint8_t *err_code = 0)
{
	converter_regulation_t *r = (channel == CHANNEL_5V) ? &channel_5v : 
								((channel == CHANNEL_12V) ? &channel_12v : regulation_setting_p);
	reg_setting_t *s = (current_range == CURRENT_RANGE_LOW) ? r->current_low_range : 
					   ((current_range == CURRENT_RANGE_HIGH) ? r->current_high_range : r->current);
	
	uint8_t result = SetRegulationLimit(s, limit_type, new_value, enable);
	if (err_code) *err_code = result;
	
	// Ensure that current setting lies inside new limits
	return Converter_SetCurrent(channel, current_range, s->setting);
}


//---------------------------------------------------------------------------//
// 	Set converter overload protection parameters
//	input:
//		channel - converter channel to affect
//		protection_enable - set protection enabled or disabled
//		overload_timeout - specifies delay between overload discovering and turning OFF converter
//	output:
//		non-zero if operating channel has been affected
//---------------------------------------------------------------------------//
static uint8_t Converter_SetProtectionControl(uint8_t channel, uint8_t protection_enable, int16_t overload_timeout, uint8_t *err_code = 0)
{
	converter_regulation_t *r = (channel == CHANNEL_5V) ? &channel_5v : 
								((channel == CHANNEL_12V) ? &channel_12v : regulation_setting_p);
	uint8_t operating_channel_affected = 0;
	uint8_t result = VALUE_OK;
	
