zpq001/mdr32f9q-ps200w/src/converter.c
	// Bound new value
	if (overload_timeout >= MAX_OVERLOAD_TIMEOUT)
	{
		overload_timeout = MAX_OVERLOAD_TIMEOUT;
		result = VALUE_BOUND_BY_ABS_MAX;
	}
	if (overload_timeout <= MIN_OVERLOAD_TIMEOUT)
	{
		overload_timeout = MIN_OVERLOAD_TIMEOUT;
		result = VALUE_BOUND_BY_ABS_MIN;
	}
		
	r->overload_protection_enable = protection_enable;
	r->overload_timeout = overload_timeout;
	if (err_code) *err_code = result;
	
	// Update hardware
	if (r == regulation_setting_p)
	{
		// Overload protection mechanism uses data from regulation_setting_p, so no
		// 	special settings are required.
		operating_channel_affected = 1;
	}
	return operating_channel_affected;
}





//---------------------------------------------------------------------------//
// 	Set converter channel
//	CHECKME
//---------------------------------------------------------------------------//
static uint8_t Converter_SetChannel(uint8_t new_value)
{
	// Check that converter is disabled
	if (GetConverterState() == CONVERTER_ON)
		return 0;
	// Check argument - should be either CHANNEL_5V or CHANNEL_12V
	if ( (new_value != CHANNEL_5V) && (new_value != CHANNEL_12V) )
		return 0;
	
	regulation_setting_p = (channel == CHANNEL_5V) ? &channel_5v : &channel_12v;
	
	// Apply controls
	__disable_irq();
	SetFeedbackChannel(regulation_setting_p->CHANNEL);		// PORTF can be accessed from ISR
	__enable_irq();
	SetCurrentRange(regulation_setting_p->current->RANGE);
	SetOutputLoad(regulation_setting_p->load_state);
	ApplyAnalogRegulation( APPLY_VOLTAGE | APPLY_CURRENT );
	// Overload protection mechanism uses data from regulation_setting_p, so no
	// 	special settings are required.
	
	return 1;
}



//---------------------------------------------------------------------------//
// 	Set converter current range
//	CHECKME
//---------------------------------------------------------------------------//
static uint8_t Converter_SetCurrentRange(uint8_t channel, uint8_t new_value)
{
	converter_regulation_t *r = (channel == CHANNEL_5V) ? &channel_5v : 
								((channel == CHANNEL_12V) ? &channel_12v : regulation_setting_p);

	// Check that converter is disabled
	if (GetConverterState() == CONVERTER_ON)
		return 0;
	// Check argument - should be either CURRENT_RANGE_LOW or CURRENT_RANGE_HIGH
	if ( (new_value != CURRENT_RANGE_LOW) && (new_value != CURRENT_RANGE_HIGH) )
		return 0;
	
	r->current = (new_value == CURRENT_RANGE_LOW) ? &r->current_low_range : &r->current_high_range;
	
	if (r == regulation_setting_p)
	{
		SetCurrentRange(regulation_setting_p->current->RANGE);
		ApplyAnalogRegulation( APPLY_CURRENT );
		return 1;
	}
	else
		return 0;
}




void Converter_Init(uint8_t default_channel)
{
	// Converter is powered off.
	// TODO: add restore from EEPROM
	
	//---------- Channel 5V ------------//
	
	// Common
	channel_5v.CHANNEL = CHANNEL_5V;
	channel_5v.load_state = LOAD_ENABLE;										// dummy - load at 5V channel can not be disabled
	channel_5v.overload_protection_enable = 1;									// TODO: EEPROM
	channel_5v.overload_timeout = (5*1);										// TODO: EEPROM
	
	// Voltage
	channel_5v.voltage.setting = 5000;											// TODO: EEPROM
	channel_5v.voltage.MINIMUM = CONV_MIN_VOLTAGE_5V_CHANNEL;					// Minimum voltage setting for channel
	channel_5v.voltage.MAXIMUM = CONV_MAX_VOLTAGE_5V_CHANNEL;					// Maximum voltage setting for channel
	channel_5v.voltage.limit_low = CONV_MIN_VOLTAGE_5V_CHANNEL;					// TODO: EEPROM
	channel_5v.voltage.limit_high = CONV_MAX_VOLTAGE_5V_CHANNEL;				// TODO: EEPROM
	channel_5v.voltage.LIMIT_MIN = CONV_MIN_VOLTAGE_5V_CHANNEL;					// Minimum voltage limit setting
	channel_5v.voltage.LIMIT_MAX = CONV_MAX_VOLTAGE_5V_CHANNEL;					// Maximum voltage limit setting
	channel_5v.voltage.enable_low_limit = 0;									// TODO: EEPROM
	channel_5v.voltage.enable_high_limit = 0;									// TODO: EEPROM
	
	// Current
	channel_5v.current_low_range.RANGE = CURRENT_RANGE_LOW;						// LOW current range
	channel_5v.current_low_range.setting = 4000;								// TODO: EEPROM
	channel_5v.current_low_range.MINIMUM = CONV_LOW_CURRENT_RANGE_MIN;			// Minimum current setting for specified current range
	channel_5v.current_low_range.MAXIMUM = CONV_LOW_CURRENT_RANGE_MAX;			// Maximum current setting for specified current range
	channel_5v.current_low_range.limit_low = CONV_LOW_CURRENT_RANGE_MIN;		// TODO: EEPROM
	channel_5v.current_low_range.limit_high = CONV_LOW_CURRENT_RANGE_MAX;		// TODO: EEPROM
	channel_5v.current_low_range.LIMIT_MIN = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current limit setting
	channel_5v.current_low_range.LIMIT_MAX = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current limit setting
	channel_5v.current_low_range.enable_low_limit = 0;							// TODO: EEPROM
	channel_5v.current_low_range.enable_high_limit = 0;							// TODO: EEPROM
	
	channel_5v.current_high_range.RANGE = CURRENT_RANGE_HIGH;					// HIGH current range
	channel_5v.current_high_range.setting = 4000;								// TODO: EEPROM
	channel_5v.current_high_range.MINIMUM = CONV_HIGH_CURRENT_RANGE_MIN;		// Minimum current setting for specified current range
	channel_5v.current_high_range.MAXIMUM = CONV_HIGH_CURRENT_RANGE_MAX;		// Maximum current setting for specified current range
	channel_5v.current_high_range.limit_low = CONV_HIGH_CURRENT_RANGE_MIN;		// TODO: EEPROM
	channel_5v.current_high_range.limit_high = CONV_HIGH_CURRENT_RANGE_MAX;		// TODO: EEPROM
	channel_5v.current_high_range.LIMIT_MIN = CONV_HIGH_CURRENT_RANGE_MIN;		// Minimum current limit setting
	channel_5v.current_high_range.LIMIT_MAX = CONV_HIGH_CURRENT_RANGE_MAX;		// Maximum current limit setting
	channel_5v.current_high_range.enable_low_limit = 0;							// TODO: EEPROM
	channel_5v.current_high_range.enable_high_limit = 0;						// TODO: EEPROM

	channel_5v.current = &channel_5v.current_low_range;
	
	//---------- Channel 12V -----------//
	
	// Common
	channel_12v.CHANNEL = CHANNEL_12V;
	channel_12v.load_state = LOAD_ENABLE;										
	channel_12v.overload_protection_enable = 1;									// TODO: EEPROM
	channel_12v.overload_timeout = (5*1);										// TODO: EEPROM
	
	// Voltage
	channel_12v.voltage.setting = 12000;										// TODO: EEPROM
	channel_12v.voltage.MINIMUM = CONV_MIN_VOLTAGE_12V_CHANNEL;					// Minimum voltage setting for channel
	channel_12v.voltage.MAXIMUM = CONV_MAX_VOLTAGE_12V_CHANNEL;					// Maximum voltage setting for channel
	channel_12v.voltage.limit_low = CONV_MIN_VOLTAGE_12V_CHANNEL;				// TODO: EEPROM
	channel_12v.voltage.limit_high = CONV_MAX_VOLTAGE_12V_CHANNEL;				// TODO: EEPROM
	channel_12v.voltage.LIMIT_MIN = CONV_MIN_VOLTAGE_12V_CHANNEL;				// Minimum voltage limit setting
	channel_12v.voltage.LIMIT_MAX = CONV_MAX_VOLTAGE_12V_CHANNEL;				// Maximum voltage limit setting
	channel_12v.voltage.enable_low_limit = 0;									// TODO: EEPROM
	channel_12v.voltage.enable_high_limit = 0;									// TODO: EEPROM
	
	// Current
	channel_12v.current_low_range.RANGE = CURRENT_RANGE_LOW;					// LOW current range
	channel_12v.current_low_range.setting = 2000;								// TODO: EEPROM
	channel_12v.current_low_range.MINIMUM = CONV_LOW_CURRENT_RANGE_MIN;			// Minimum current setting for specified current range
	channel_12v.current_low_range.MAXIMUM = CONV_LOW_CURRENT_RANGE_MAX;			// Maximum current setting for specified current range
	channel_12v.current_low_range.limit_low = CONV_LOW_CURRENT_RANGE_MIN;		// TODO: EEPROM
	channel_12v.current_low_range.limit_high = CONV_LOW_CURRENT_RANGE_MAX;		// TODO: EEPROM
	channel_12v.current_low_range.LIMIT_MIN = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current limit setting
	channel_12v.current_low_range.LIMIT_MAX = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current limit setting
	channel_12v.current_low_range.enable_low_limit = 0;							// TODO: EEPROM
	channel_12v.current_low_range.enable_high_limit = 0;						// TODO: EEPROM
	
	// 12V channel cannot provide currents > 20A (low range)
	channel_12v.current_high_range.RANGE = CURRENT_RANGE_HIGH;					// HIGH current range
	channel_12v.current_high_range.setting = 4000;								// TODO: EEPROM
	channel_12v.current_high_range.MINIMUM = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current setting for specified current range
	channel_12v.current_high_range.MAXIMUM = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current setting for specified current range
	channel_12v.current_high_range.limit_low = CONV_LOW_CURRENT_RANGE_MIN;		// TODO: EEPROM
	channel_12v.current_high_range.limit_high = CONV_LOW_CURRENT_RANGE_MAX;		// TODO: EEPROM
	channel_12v.current_high_range.LIMIT_MIN = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current limit setting
	channel_12v.current_high_range.LIMIT_MAX = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current limit setting
	channel_12v.current_high_range.enable_low_limit = 0;						// TODO: EEPROM
	channel_12v.current_high_range.enable_high_limit = 0;						// TODO: EEPROM

	channel_12v.current = &channel_12v.current_low_range;
	
	
	// Select default channel
	Converter_SetChannel(CHANNEL_12V);

