zpq001/mdr32f9q-ps200w/src/converter.c
	/*
	if (default_channel == CHANNEL_12V)
		regulation_setting_p = &channel_12v;
	else
		regulation_setting_p = &channel_5v;
	
	
	// Apply controls
	__disable_irq();
	SetFeedbackChannel(regulation_setting_p->CHANNEL);		// PORTF can be accessed from ISR
	__enable_irq();
	SetCurrentRange(regulation_setting_p->current->RANGE);
	SetOutputLoad(regulation_setting_p->load_state);
	apply_regulation();										// Apply voltage and current settings
	*/
}




static uint32_t analyzeAndResetHWErrorState(void)
{
	uint32_t state_flags;
	if (state_HWProcess & STATE_HW_OVERLOADED)		
	{
		ctrl_HWProcess = CMD_HW_RESET_OVERLOAD;		
		while(ctrl_HWProcess);
		state_flags = CONV_OVERLOAD;	
	}
	// Add more if necessary
	else
	{
		state_flags = 0;
	}
	return state_flags;
}

static uint32_t disableConverterAndCheckHWState(void)
{
	uint32_t new_state;
	
#if CMD_HAS_PRIORITY == 1
	// If error status is generated simultaneously with OFF command,
	// converter will be turned off and no error status will be shown
	ctrl_HWProcess = CMD_HW_OFF | CMD_HW_RESET_OVERLOAD;	// Turn off converter and suppress error status (if any)
	while(ctrl_HWProcess);
	new_state = CONV_OFF;		
	
#elif ERROR_HAS_PRIORITY == 1
	// If error status is generated simultaneously with OFF command,
	// converter will be turned off, but error status will be indicated
	ctrl_HWProcess = CMD_HW_OFF;					// Turn converter off
	while(ctrl_HWProcess);
	new_state = CONV_OFF;	
	new_state |= analyzeAndResetHWErrorState();	
						
#endif
	return new_state;
}




static void SoundEvent_OnSettingChanged(uint8_t code)
{
	uint32_t sound_msg;
	if ((err_code == VALUE_BOUND_BY_SOFT_MAX) || (err_code == VALUE_BOUND_BY_SOFT_MIN))
		sound_msg = SND_CONV_SETTING_ILLEGAL;
	else if ((err_code == VALUE_BOUND_BY_ABS_MAX) || (err_code == VALUE_BOUND_BY_ABS_MIN))
		sound_msg = SND_CONV_SETTING_ILLEGAL;
	else
		sound_msg = SND_CONV_SETTING_OK;
	sound_msg |= SND_CONVERTER_PRIORITY_NORMAL;
	xQueueSendToBack(xQueueSound, &sound_msg, 0);
}



uint8_t taskConverter_Enable = 0;



//---------------------------------------------//
//	Main converter task
//	
//---------------------------------------------//
void vTaskConverter(void *pvParameters) 
{
	conveter_message_t msg;
	
	uint8_t err_code;
	uint8_t upd_gui;
	uint32_t adc_msg;
	
	
	// Initialize
	xQueueConverter = xQueueCreate( 5, sizeof( conveter_message_t ) );		// Queue can contain 5 elements of type conveter_message_t
	if( xQueueConverter == 0 )
	{
		// Queue was not created and must not be used.
		while(1);
	}
	
	// Wait until task is started by dispatcher
	//vTaskSuspend(vTaskConverter);			
	
	while (taskConverter_Enable == 0)
		vTaskDelay(5);
	
	xQueueReset(xQueueConverter);
	
	
	while(1)
	{
		xQueueReceive(xQueueConverter, &msg, portMAX_DELAY);
	

		switch (msg.type)
		{
			case CONVERTER_SET_VOLTAGE:
				Converter_SetVoltage(msg.voltage_setting.channel, msg.voltage_setting.value, &err_code);
				//----- Send notification to GUI -----//
				gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
				gui_msg.converter_event.spec = VOLTAGE_SETTING_CHANGED;
				gui_msg.converter_event.channel = msg.voltage_setting.channel;
				xQueueSendToBack(xQueueGUI, &gui_msg, 0);
				//------------------------------------//
				if (msg.sender != TID_UART)
					SoundEvent_OnSettingChanged(err_code);
				msg.type = 0;
				break;
			case CONVERTER_SET_CURRENT:
				Converter_SetCurrent(msg.current_setting.channel, msg.current_setting.range, msg.current_setting.value, &err_code);
				//----- Send notification to GUI -----//
				gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
				gui_msg.converter_event.spec = CURRENT_SETTING_CHANGED;
				gui_msg.converter_event.channel = msg.current_setting.channel;
				gui_msg.converter_event.current_range = msg.current_setting.range;
				xQueueSendToBack(xQueueGUI, &gui_msg, 0);
				//------------------------------------//
				if (msg.sender != TID_UART)
					SoundEvent_OnSettingChanged(err_code);
				msg.type = 0;
				break;
			case CONVERTER_SET_VOLTAGE_LIMIT:
				Converter_SetVoltageLimit(msg.voltage_limit_setting.channel, msg.voltage_limit_setting.type, 
									msg.voltage_limit_setting.value, msg.voltage_limit_setting.enable, &err_code);
				//----- Send notification to GUI -----//					
				gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
				gui_msg.converter_event.spec = VOLTAGE_LIMIT_CHANGED;
				gui_msg.converter_event.channel = msg.voltage_limit_setting.channel;
				gui_msg.converter_event.type = msg.voltage_limit_setting.type;
				xQueueSendToBack(xQueueGUI, &gui_msg, 0);
				//------------------------------------//
				if (msg.sender != TID_UART)
					SoundEvent_OnSettingChanged(err_code);
				msg.type = 0;
				break;
			case CONVERTER_SET_CURRENT_LIMIT:
				// static uint8_t Converter_SetCurrentLimit(uint8_t channel, uint8_t current_range, uint8_t limit_type, int32_t new_value, uint8_t enable, uint8_t *err_code);
				Converter_SetCurrentLimit(msg.current_limit_setting.channel, msg.current_limit_setting.range, msg.current_limit_setting.type, 
									msg.current_limit_setting.value, msg.current_limit_setting.enable, &err_code);
				//----- Send notification to GUI -----//					
				gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
				gui_msg.converter_event.spec = CURRENT_LIMIT_CHANGED;
				gui_msg.converter_event.channel = msg.current_limit_setting.channel;
				gui_msg.converter_event.type = msg.current_limit_setting.type;
				gui_msg.converter_event.current_range = msg.current_limit_setting.range;
				xQueueSendToBack(xQueueGUI, &gui_msg, 0);
				//------------------------------------//
				if (msg.sender != TID_UART)
					SoundEvent_OnSettingChanged(err_code);
				msg.type = 0;
				break;
				
			// TODO: add overload and other settings
				
			
			case CONVERTER_TICK:		// Temporary! Will be special for charging mode
				// ADC task is responsible for sampling and filtering voltage and current
				adc_msg = ADC_GET_ALL_NORMAL;
				xQueueSendToBack(xQueueADC, &adc_msg, 0);
				msg.type = 0;
				break;
		}
		
		// Other messages should get processing depending on converter state

		while(msg.type)
		{
			//------------------------------------//
			//------------------------------------//
			switch(conv_state & CONV_STATE_MASK)
			{
				case CONV_OFF:
					if (msg.type == CONVERTER_SWITCH_CHANNEL)
					{
						Converter_SetChannel(msg.channel_setting.new_channel);
						ctrl_HWProcess = CMD_HW_RESTART_USER_TIMER;
						//----- Send notification to GUI -----//
						gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
						gui_msg.converter_event.spec = CHANNEL_CHANGED;
						gui_msg.converter_event.channel = msg.channel_setting.new_channel;
						xQueueSendToBack(xQueueGUI, &gui_msg, 0);
						//------------------------------------//
						msg.type = 0;
						while(ctrl_HWProcess);
						break;
					}
					if (msg.type == CONVERTER_SET_CURRENT_RANGE)
					{
						Converter_SetCurrentRange(msg.current_range_setting.channel, msg.current_range_setting.new_range);
						ctrl_HWProcess = CMD_HW_RESTART_USER_TIMER;
						//----- Send notification to GUI -----//
						gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
						gui_msg.converter_event.spec = CURRENT_RANGE_CHANGED;
						gui_msg.converter_event.channel = msg.current_range_setting.channel;
						gui_msg.converter_event.current_range = msg.current_range_setting.new_range;
						xQueueSendToBack(xQueueGUI, &gui_msg, 0);
						//------------------------------------//
						msg.type = 0;
						while(ctrl_HWProcess);
						break;
					}

					if (msg.type == CONVERTER_TURN_OFF)
					{
						conv_state = CONV_OFF;			// Reset overload flag
						break;
					}
					if (msg.type == CONVERTER_TURN_ON)
					{
						// Message to turn on converter is received
						if ((state_HWProcess & STATE_HW_TIMER_NOT_EXPIRED) || (!(state_HWProcess & STATE_HW_USER_TIMER_EXPIRED)))
						{
							// Safe timeout is not expired
							break;
						}
						ctrl_HWProcess = CMD_HW_ON;
						while(ctrl_HWProcess);
						conv_state = CONV_ON;			// Switch to new state and reset overload flag
						break;
					}
					break;
				case CONV_ON:
					if (msg.type == CONVERTER_TURN_OFF)
					{
						conv_state = disableConverterAndCheckHWState();
						break;
					}
					if (msg.type == CONVERTER_SWITCH_CHANNEL)
					{
						conv_state = disableConverterAndCheckHWState();
						vTaskDelay(4);
						break;
					}
					// CONVERTER_SET_CURRENT_RANGE is ignored when converter is ON
					
					if (state_HWProcess & STATE_HW_OFF)
					{
						// Some hardware error has happened and converter had been switched off
						conv_state = CONV_OFF;
						conv_state |= analyzeAndResetHWErrorState();
						if (conv_state & CONV_OVERLOAD)
						{
							// Send message to sound driver
							// TODO: send this message in other cases (when overload is detected simultaneously with button)
							sound_msg = SND_CONV_OVERLOADED | SND_CONVERTER_PRIORITY_HIGHEST;
							xQueueSendToBack(xQueueSound, &sound_msg, 0);
						}
						break;
					}
					msg.type = 0;
					break;
			}
			//------------------------------------//
			//------------------------------------//
		}

